<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"http","label":"production","backend":"6db79414a742852702e0f1ab831f42d31580041b6ad005624ce5b2348e7cf417","plan_job_ref":"Job Cloudflare Infra #7 at https://github.com/SableClient/Sable/actions/runs/22967051147","plan_out_hash":"330fe8066c10314e21f2e6c26433cf665b5e7ae57cf559a18ceb852eccee0c8a","plan_hash":"0cdac47b93364d5243bd2e510bfaf1f2b453446e799072529424473bca179065","plan_text_format":"diff","version":"2.2.3"} -->
OpenTofu plan for __production__
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy.</summary>

```diff
OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

OpenTofu will perform the following actions:

  # cloudflare_worker_version.site must be replaced
-/+ resource "cloudflare_worker_version" "site" {
!~      annotations         = {
+           workers_message      = (known after apply)
+           workers_tag          = (known after apply)
!~          workers_triggered_by = "create_version_api" -> (known after apply)
        } -> (known after apply)
!~      assets              = { # forces replacement
!~          asset_manifest_sha256 = "571894a54b399bef7a5c40ab051dc6886b2bc8e182571076198b96e31efe3158" -> "cd99ad0c1e17657938f2298c251c151009a0576648daf3f1dbe57a41d49b92bf" # forces replacement
!~          directory             = "/home/runner/work/Sable/Sable/dist" -> "/github/workspace/dist"
#            (1 unchanged attribute hidden)
        }
+       compatibility_flags = (known after apply)
!~      created_on          = "2026-03-10T06:07:19Z" -> (known after apply)
!~      id                  = "************************************" -> (known after apply)
+       limits              = (known after apply)
+       main_script_base64  = (known after apply)
!~      number              = 2 -> (known after apply)
!~      source              = "terraform" -> (known after apply)
+       startup_time_ms     = (known after apply)
#        (4 unchanged attributes hidden)
    }

  # cloudflare_workers_deployment.site must be replaced
-/+ resource "cloudflare_workers_deployment" "site" {
!~      annotations  = { # forces replacement
!~          workers_message      = <<-EOT
              - Merge pull request #126 from SableClient/prepare-release
              - 
              - prepare release
              + chore: migrate package manager from npm to pnpm
            EOT
!~          workers_triggered_by = "deployment" -> (known after apply)
        }
!~      author_email = "cloudflare@sl.sable.moe" -> (known after apply)
!~      created_on   = "2026-03-10T06:07:20Z" -> (known after apply)
!~      id           = "************************************" -> (known after apply)
!~      source       = "terraform" -> (known after apply)
!~      versions     = [ # forces replacement
!~          {
!~              version_id = "************************************" -> (known after apply)
#                (1 unchanged attribute hidden)
            },
        ]
#        (3 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Warning: Attribute Deprecated

  with cloudflare_workers_custom_domain.site,
  on main.tf line 41, in resource "cloudflare_workers_custom_domain" "site":
  41:   environment = "production"

This attribute is deprecated.

(and one more similar warning elsewhere)
```
</details>

:memo: Plan generated in [Cloudflare Infra #7](https://github.com/SableClient/Sable/actions/runs/22967051147)